R03(config)#router isis
R03(config-router)#net 49.0002.0000.0000.0003.00
R03(config-router)#exit

R03(config)#interface fastEthernet 0/0
R03(config-if)#ip router isis
R03(config-if)#isis circuit-type level-1
R03(config-if)#exit

R03(config)#interface serial 2/1
R03(config-if)#ip router isis
R03(config-if)#isis circuit-type level-1
R03(config-if)#exit
-----------------------------------------------------

R01(config)#router isis
R01(config-router)#net 49.0002.0000.0000.0001.00
R01(config-router)#exit

R01(config)#interface serial 2/1
R01(config-if)#ip router isis
R01(config-if)#isis circuit-type level-1
R01(config-if)#exit

R01(config)#interface serial 2/0
R01(config-if)#ip router isis
R01(config-if)#isis circuit-type level-2-only
R01(config-if)#exit
-----------------------------------------------------

R02(config)#router isis
R02(config-router)#net 49.0003.0000.0000.0002.00
R02(config-router)#exit

R02(config)#interface serial 2/0
R02(config-if)#ip router isis
R02(config-if)#isis circuit-type level-2-only
R02(config-if)#exit

R02(config)#interface serial 2/1
R02(config-if)#ip router isis
R02(config-if)#isis circuit-type level-1
R02(config-if)#exit
-------------------------------------------------

R04(config)#router isis
R04(config-router)#net 49.0003.0000.0000.0004.00
R04(config-router)#exit

R04(config)#interface serial 2/1
R04(config-if)#ip router isis
R04(config-if)#isis circuit-type level-1
R04(config-if)#exit

R04(config)#interface fastEthernet 0/0
R04(config-if)#ip router isis
R04(config-if)#isis circuit-type level-1
R04(config-if)#exit
---------------------------------------------------
R01#show isis neighbors
R01#show isis neighbors detail
R01#show ip route

---------------------------------------------------

